# Решение домашнего задания к Семинару №2


## 1.Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

```
print('''
1.Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
'''
)

def summiyogo(n): #Функция с аргументом 
    sum = 0 # Счетчик
    for i in number: # Цикл с пробужкой 
        sum += int(i) 
    return sum

number = input("Введите вещественное число: ").replace(".", "").replace(",", "")

print(summiyogo(number))
```

## 2.Для натурального n создать список, состоящий из элементов последовательности 3n + 1
### Пример:
- Для n = 6: [4, 7, 10, 13, 16, 19]

## 3.Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.

# Домашнее задание

## 1 Подсчитать сумму цифр в вещественном числе.
```

```
## 2 Написать программу получающую набор произведений чисел от 1 до N.
Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ]
```

```
## 3 Задать список из n чисел последовательности (1+ 1 ) и вывести на экран их сумму.n
```

```
## 4 Задать список из N элементов, заполненных числами из [-N, N]. Найти произведение элементов на указанных позициях. Позиции хранятся в списке positions - создайте этот список 
### например:
positions = [1, 3, 6]).

## 5 Реализовать алгоритм перемешивания списка.