# Решение домашнего задания к Семинару №2


## 1.Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

```
print('''
1.Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
'''
)

def summiyogo(n): #Функция с аргументом 
    sum = 0 # Счетчик
    for i in number: # Цикл с пробужкой 
        sum += int(i) 
    return sum

number = input("Введите вещественное число: ").replace(".", "").replace(",", "")

print(summiyogo(number))
```

## 2.Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
*Пример:*

- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

```
```
