# Урок 3. Данные, функции и модули в Python

## Эксперемент с ASCII - графикой  


     
                                 ,▄▄▄▓▓████████▓▓▄▄,
                             ,▄████████████████████████▄
                            █████╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬████▄
                           ███▒╬╬╬███▒╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╣███
                           ███╬╬╬█████╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬███─
                           ███╬╬╬╬███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬███─
                       ,   ███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬███▄▄▄▄▄╓
                  ▄▓███████████████████████╬╬╬╬╬╬╬╬╬╬╬╬╬████████████▄
                ▓████╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▒░░░░░│╙▀███▄
              ╓███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▒░░░░░░░░│╙███
             ]███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▒░░░░░░░░░░╟██▌
             ███▒╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██░░░░░░░░░░░░███
             ███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██▌░░░░░░░░░░░░╟██⌐
            ▐███╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓▓█████▀░░░░░░░░░░░░░╟██Γ
            ▐███╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓████▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀╙└░░░░░░░░░░░░░░░╟██Γ
             ███╬╬╬╬╬╬╬╬╬╬╬╬╬██▀└'│││││░││░░░░░░░░░░░░░░░░░░░░░░░░░░░░╟██Γ
             ███╬╬╬╬╬╬╬╬╬╬╬╬██▀││││││░░│░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░███
             ╟███╬╬╬╬╬╬╬╬╬╬╬██│││││░││░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▐██▌
              ███▓╬╬╬╬╬╬╬╬╬╬██│││░││░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄███
               ▀███▓╬╬╬╬╬╬╬╬██│░│░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░,▄███▀
                └▀████████████│░░░░░░░░░░░░█████████████████████████▀
                   └▀▀▀▀▀▀▀███░░░░░░░░░░░░░└└└└└└│││││││╫██▀▀▀▀▀╙└
                           ███░░░░░░░░░░░░░░░░░░░Q▄▄░░░░╫██─
                           ███░░░░░░░░░░░░░░░░░░▓████░░░╫██─
                           ███▄░░░░░░░░░░░░░░░░░╙███▀░░░███─
                            ████▄░░░░░░░░░░░░░░░░░░░░░▄███▀
                             ╙▀█████▄▄▄▄▄▄▄▄▄▄▄▄▄▄▓█████▀─
                                └╙▀▀███████████████▀▀╙─
     
     
     
 
## 1.Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
## Тут предоставлены эксперементы с escape - строках и ASCII - графика
*Пример:*

- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

```
print(
    '''
_   _   ___   __  __  ___       __      __  ___   ___  _  __         ____ 
| || | / _ \ |  \/  || __|      \ \    / / / _ \ | _ \| |/ /        |__ / 
| __ || (_) || |\/| || _|        \ \/\/ / | (_) ||   /|   <          |_ \ 
|_||_| \___/ |_|  |_||___|        \_/\_/   \___/ |_|_\|_|\_\        |___/ 

    '''

)

print(
    '''
    1.Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
*Пример:*

- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

    '''
)

lost1 = (2,3,5,9,3)
res =0 
for i in range(len(lost1)):
    if i % 2 != 0:
        res += lost1[i]
print('Ответ: ',res)

# Демонстрация escape строк 

print("\t\t\tТабуляция")

print("\t\t\t \\ \\ \\ \\ \\ \\ \\")
print("\t\t\t\tby")
print("\t\t\tМаксиму Сергеевичу")
print("\t\t\t \\ \\ \\ \\ \\ \\ \\")

print("\nОтдельное спасибо хотелось сказать Майклу доусону")

# Должен сработать звуковой сигнал но на mac не работает 
print("\a")

input("\n\nНажмите Enter чтобы выйти.")

```
## 2.Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
*Пример:*

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]


## 3.Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
*Пример:*

- [1.1, 1.2, 3.1, 5, 10.01] => 0.19


## 4.Напишите программу, которая будет преобразовывать десятичное число в двоичное.
*Пример:*

- 45 -> 101101
- 3 -> 11
- 2 -> 10

## 5.Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
*Пример:*

- для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи] (https://ru.wikipedia.org/wiki/Негафибоначчи)