# Домашнее задание 4

## 1. Вычислить число c заданной точностью d
пример 
d = 0.001, π = 3.141 10-1 <= d <= 10-10
```python
print(
    '''
 _  _                        __      __           _           _ _    
| || | ___  _ __   ___       \ \    / / ___  _ _ | |__       | | |   
| __ |/ _ \| '  \ / -_)       \ \/\/ / / _ \| '_|| / /       |_  _|  
|_||_|\___/|_|_|_|\___|        \_/\_/  \___/|_|  |_\_\         |_|   

    '''
)
print(
    """
     1. Вычислить число c заданной точностью d
пример 
d = 0.001, π = 3.141 10-1 <= d <= 10-10
    """
)

from cmath import pi

d = int(input("Введите точность числа Пи "))
print(f"Число Пи с заданной точностью {d} равно {round(pi,d)}")
```
## 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
```python
print(
    '''
 _              _           _ _              ___  
| |_  __ _  ___| |__       | | |            |_  ) 
|  _|/ _` |(_-/| / /       |_  _|    _       / /  
 \__|\__/_|/__/|_\_\         |_|    (_)     /___| 

    '''
)
print(
    """
    2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
    """
)

num = int(input("Введите число: "))
i = 2  # первое простое число
lst = []
old = num
while i <= num:
    if num % i == 0:
        lst.append(i)
        num //= i
        i = 2
    else:
        i += 1
print(f"Простые множители числа {old} приведены в списке: {lst}")

```
## 3. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
```python

```
## 4 Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл многочлен
Пример
k=2 => 2x² + 4x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
```python

```
## 5. Даны два файла, в каждом из которых находится запись многочлена. Задача - сформировать файл, содержащий сумму многочленов.
```python

```